import React, { Component } from 'react';
import { BrowserRouter as Router,Route,Link} from 'react-router-dom';
import { NavBar, Icon, Tabs ,Carousel} from 'antd-mobile';
export default class Fuwu extends Component {
  render() {
    return (
      <div>
         <NavBar
            style={{ width:'100%',backgroundColor:'#37376f',color:'#fff',position:'fixed ',top:'0',zIndex:1,height:'7vh'}}
            leftContent={[
                <Link to="/shezhi"><span style={{fontSize:'17px',color:'white'}} className="iconfont icon-ico_leftarrow"></span></Link>
            ]}
            >
            <span>服务协议和隐私政策</simport React, { Component } from 'react';
import {Link} from 'react-router-dom';
import { NavBar} from 'antd-mobile';
export default class Fuwu extends Component {
  render() {
    return (
      <div>
         <NavBar
            style={{ width:'100%',backgroundColor:'#37376f',color:'#fff',position:'fixed ',top:'0',zIndex:1,height:'7vh'}}
            leftContent={[
                <Link to="/shezhi"><span style={{fontSize:'17px',color:'white'}} className="iconfont icon-ico_leftarrow"></span></Link>
            ]}
            >
            <span>服务协议和隐私政策</span>
            
        </NavBar>
        <div className='cepingImg'>
              <div className='cepingBox' >
                <div className='cepingword'>
                  <p>为了更好地为您提供服务，请您仔细阅读本“服务协议和隐私政策”（以下简称 “本协议”）。在您开始使用本软件及相关服务之前，请您务必认真阅读并充分理解本协议，特别是涉及免除或者限制责任的条款，权利许可和信息使用的条款，同意开通和使用特殊单项服务的条款，法律适用和争议解决条款等。其中，免除或者限制责任条款等重要内容将以加粗形式提示您注意，您应重点阅读。如您未满18周岁，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后下载本软件。</p>
                  <p style={{marginTop:'-2.7vh'}}>除非您完全接受本协议的全部内容，否则您无权下载，安装，注册，登录，使用（以下统称 “使用”）本软件，或者通过任何方式使用本服务，或者获得本软件提供的任何服务（本协议中统称“使用”）。若您使用本软件及相关服务，则视为您已充分理解本协议并承诺作为本协议的一方当事人接受协议的约束。</p>
                  <p style={{marginTop:'-2.7vh'}}>1、适用范围</p>
                  <p style={{marginTop:'-2.7vh'}}>1.1本协议是您与本开发者（以下简称“我们”）之间就您下载，安装，注册，登录，使用本软件，并获得本软件提供的相关服务所订立的协议。我们有权依本软件及相关服务或运营的需要单方决定，安排或指定其关联我们，控制我们，继承我们或我们认可的第三方我们继续运营本软件。并且，就本协议项下涉及的某些服务，可能会由我们的关联我们，控制我们，继承我们或我们认可的第三方我们向您提供。您知晓并同意接受相关服务内容，即视为接受相关权利义务关系亦受本协议约束。</p>
                  <p style={{marginTop:'-2.7vh'}}>1.2“用户”指所有直接或间接获取和使用本软件及相关服务的使用者，包括自然人，法人及其他组织等。在本协议中称为“用户”或称“您”。</p>
                  <p style={{marginTop:'-2.7vh'}}>1.3本指由我们合法拥有并运营的，标注名称为本的客户端应用程序我们有权对应用程序及名称单方变更（包括但不限于更名，新增等）。</p>
                  <p style={{marginTop:'-2.7vh'}}>1.4本协议内容同时包括我们已经发布及后续可能不断发布的关于本软件及相关服务的相关协议，规则等内容。前述内容一经正式发布，并以适当的方式送达用户（网站公布，系统通知等），即为本协议不可分割的组成部分，您应同样遵守。</p>
                  <p style={{marginTop:'-2.7vh'}}>2，使用本软件及相关服务</p>
                  <p style={{marginTop:'-2.7vh'}}>2.1您使用本软件及相关服务，可以通过预装，我们已授权的第三方下载等方式获取本客户端应用程序。若您并非从我们或经我们授权的第三方获取本软件的，我们无法保证非官方版本的本软件能够正常使用，您因此遭受的损失与我们无关。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.2我们可能为不同的终端设备开发了不同的应用程序软件版本，您应当根据实际设备状况获取，下载，安装合适的版本。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.3您可根据自行需要使用本软件及相关服务或更新本版本，如您不再需要使用本软件及相关服务可自行卸载。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.4为更好的提升用户体验及服务，我们将不定期提供软件更新或改变（包括但不限于软件修改，升级，功能强化，开发新服务，软件替换等）。为保证本软件及相关服务安全，提升用户服务，本软件及相关服务更新或部分服务内容更新后，在可能的情况下，我们将以包括但不限于系统提示，公告，站内信等方式提示用户，用户有权选择接受更新版本或服务，如用户不接受，部分功能将受到限制或不能继续使用。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.5除非得到我们明示事先书面授权，您不得以任何形式对本软件及相关服务进行包括但不限于改编，复制，传播，镜像或交易等未经授权的访问或使用。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.6您理解，您使用本软件及相关服务需自行准备与软件及相关服务有关的终端设备（如电脑，手机等装置），一旦您在其终端设备中打开“ 青莲剑说“软件，即视为您使用” 青莲剑说“软件及相关服务。为充分实现” 青莲剑说“的全部功能，您可能需要将其终端设备联网，您理解由您承担所需要的费用（如流量费，上网费等）。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.7我们许可您个人的，不可转让的，非独占地和非商业的合法使用本软件及相关服务的权利。本协议未明示授权的其他一切权利仍由我们保留，您在行使该些权利时须另行获得我们的书面许可，同时我们如未行使前述任何权利，并不构成对该权利的放弃。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.8您需要注册才可开始使用本软件及相关服务。同时，您也理解，为使您更好地使用本软件及相关服务，保障您的账号安全，某些功能和/或某些单项服务项目，如充值服务等，要求您按照国家相关法律法规的规定，可能需要提供真实的身份信息实名注册并登陆后方可使用。</p>
                  <p style={{marginTop:'-2.7vh'}}>2.9如您发现本软件及网站内存在任何侵犯您权利的内容，请立即通过邮箱wdfj1234@qq.com通知我们，提供您有相关权利的初步证据，我们将会根据当地法律规定及时处理您的投诉。</p>
                  <p style={{marginTop:'-2.7vh'}}>3，关于“账号”</p>
                  <p style={{marginTop:'-2.7vh'}}>3.1本为用户提供了注册通道，用户有权选择合法的字符组合作为自己的账号，并自行设置符合安全要求的密码。用户设置的账号，密码是用户用以登录并以注册用户身份使用本软件及相关服务的凭证。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.2您理解并承诺，您所设置的账号不得违反国家法律法规及我们的相关规则，您的账号名称，头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名，名称，字号，头像等足以让人引起混淆的方式）开设账号，不得恶意注册本账号（包括但不限于频繁注册，批量注册账号等行为）。您在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益，损害其他公民合法权益，有害社会道德风尚的行为。我们有权对您提交的注册信息进行审核。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.3您在本中的注册账号所有权及有关权益均归我们所有，您完成注册手续后仅享有该账号的使用权。您的账号仅限于您本人使用，未经我们书面同意，禁止以任何形式赠与，借用，出租，转让，售卖或以其他方式许可他人使用该账号。如果我们发现或者有合理理由认为使用者并非账号初始注册人，我们有权在未通知您的情况下，暂停或终止向该注册账号提供服务，并有权注销该账号，而无需向注册该账号的用户承担法律责任。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.4您有责任维护个人账号，密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任，包括但不限于您在本上进行的任何数据修改，言论发表，款项支付等操作行为。您应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他任何安全漏洞问题时，您应当立即通知我们。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.5您的账号在丢失或遗忘密码后，可遵照我们的申诉途径及时申诉请求找回账号或密码。您理解并认可，我们的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。我们特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。因您保管不当可能导致遭受盗号或密码丢失，责任由您自行承担。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.6在注册，使用和管理账号时，您应保证注册账号时填写的身份信息的真实性，请您在注册，管理账号时使用真实，准确，合法，有效的相关身份证明材料及必要信息（包括您的姓名及电子邮件地址，联系电话，联系地址等）。依照国家法律法规的规定，为使用本软件及服务，您需要填写真实的身份信息，请您按照相关法律规定完成实名认证，并注意及时更新上述相关信息。若您提交的材料或提供的信息不准确，不真实，不合法或者我们有理由怀疑为错误，不实或不合法的资料，则我们有权拒绝为您提供相关服务或您可能无法使用本软件及相关服务或在使用过程中部分功能受到限制。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.7除自行注册本 账号外，您也可选择通过授权使用您合法拥有的包括但不限于我们和/或其关联我们其他软件用户账号，以及实名注册的第三方软件或平台用户账号注册并登录使用本软件及相关服务，但第三方软件或平台对此有限制或禁止的除外。当您以前述已有账号登录使用的，应保证相应账号已进行实名注册登记，并同意适用本协议中的相关约定。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.8您理解并同意，除您登录，使用本软件及相关服务外，您还可以用本账号登录使用我们及其关联我们或其他合作方提供的其他软件，服务。您以本账号登陆并使用前述服务的，同样应受其他软件，服务提供方的“用户协议”及其他协议条款约束。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.9为提高您内容曝光量及发布效率，您同意您在本软件的账号及相应账号说产生的游戏内容全部内容均授权本我们发布至我们及/或关联我们运营的系列客户端软件及网站，微信公众号上。您通过已注册或者已同步的账号登录我们及/或关联我们运营的系列客户端软件产品及网站时（如有），应遵守该软件产品及网站自身的“用户协议”及其他协议条款的规定。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.10因其他人恶意攻击或您自身原因或其他不可抗因素而导致账号被盗，丢失，均由您本人承担责任，我们不承担任何责任。</p>
                  <p style={{marginTop:'-2.7vh'}}>3.11您理解，为了充分使用账号资源，如您在注册后未及时进行初次登录使用或连续超过二个月未登录闲置账号的使用等情形，我们有权随时收回您账号。</p>
                  <p style={{marginTop:'-2.7vh'}}>4、其它</p>
                  <p style={{marginTop:'-2.7vh'}}>4.1本协议的版权为我们所有，我们保留一切解释和修改的权利。</p>
                   {/* ————————————————版权声明：本文为CSDN博主「weixin_44794785」的原创文章，遵循 CC 4.0 BY-SA 版权协议，转载请附上原文出处链接及本声明。原文链接：https://blog.csdn.net/weixin_44794785/article/details/90514416 */}
                </div>

              </div>
            </div>
      </div>
    );
  }
}
pan>
        </NavBar>
      </div>
    );
  }
}
